
#ifndef FBGEN_AILocoCoverBinding_H
#define FBGEN_AILocoCoverBinding_H

#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
#include "AntRef.h"
struct AILocoCoverBinding
{
	AntRef m_PrepareFire; // 0x0
	AntRef m_PrepareChangedToTrue; // 0x14
	AntRef m_ThrowGrenade; // 0x28
	AntRef m_PeekOut; // 0x3c
	AntRef m_IdleBehindCover; // 0x50
	AntRef m_PeekType; // 0x64
	AntRef m_IdleTypePrevious; // 0x78
	AntRef m_IdleType; // 0x8c
	AntRef m_IdleTypeChanged; // 0xa0
	AntRef m_CoverTypeEnum; // 0xb4
	AntRef m_CoverFireStyle; // 0xc8
	AntRef m_EnterCover; // 0xdc
	AntRef m_ExitCover; // 0xf0
	AntRef m_CoverDistanceSmall; // 0x104
	AntRef m_CoverDistanceMedium; // 0x118
	AntRef m_DistanceScale; // 0x12c
	AntRef m_AbsoluteDistance; // 0x140
	AntRef m_AngleToNormal; // 0x154
	AntRef m_DirectionToCoverVsAITrajectory; // 0x168
	AntRef m_CoverNormalVsAITrajectory; // 0x17c
	AntRef m_OutAngle; // 0x190
	AntRef m_ExitCoverDistance; // 0x1a4
	AntRef m_ThreatAngle; // 0x1b8
	AntRef m_StopExitCoverOutAround; // 0x1cc
	AntRef m_EnterStrategy; // 0x1e0
	AntRef m_ExitStyle; // 0x1f4
	AntRef m_CoverHoverAnimationBlocked; // 0x208
	AntRef m_CoverEnableHover; // 0x21c
	AntRef m_CoverHoverHeight; // 0x230
	AntRef m_CoverHoverLeft; // 0x244
	AntRef m_CoverHoverRight; // 0x258
	AntRef m_CoverHoverInSidefly; // 0x26c
	AntRef m_CoverHoverDone; // 0x280
	AntRef m_TriggerStep; // 0x294
	AntRef m_IsStepping; // 0x2a8
	AntRef m_SideStepDirection; // 0x2bc
	AntRef m_SideStepFuturePose; // 0x2d0
}; // size = 0x2e4

#endif // FBGEN_AILocoCoverBinding_H
